app/views/to_dos/_form.html.haml

	%br
	= f.select :assignee_id, Assignee.all.collect {|d| [d.name, d.id] }
---
SELECT "assignees".* FROM "assignees"