app/views/to_dos/index.html.haml

            = "Assigned to:"
            -if to_do.assignee.present?
---
SELECT "assignees".* FROM "assignees" WHERE "assignees"."id" = ? LIMIT 1  [["id", 2]]