app/views/to_dos/search.html.haml

          %br
          -if to_do.assignee.present?
---
SELECT "assignees".* FROM "assignees" WHERE "assignees"."id" = ? LIMIT 1  [["id", 5]]