app/views/to_dos/show.html.haml

SELECT "assignees".* FROM "assignees" WHERE "assignees"."id" = ? LIMIT 1  [["id", 5]]
---
    .panel-body
      -if @to_do.assignee.present?