app/views/assignees/index.html.haml

          %ul
            -assignee.to_dos.each do |task|
---
SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."assignee_id" = ?  [["assignee_id", 3]]