app/views/assignees/show.html.haml

      %br
      - @assignee.to_dos.each do |task|
---
SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."assignee_id" = ?  [["assignee_id", 4]]