app/controllers/assignees_controller.rb

SELECT "assignees".* FROM "assignees"
---
def index
    @assignees = Assignee.all

INSERT INTO "assignees" ("email", "name") VALUES (?, ?)  [["email", "www.google.com"], ["name", "patrick"]]
---
  def create
    @new_assignee = Assignee.new(assignee_params)
    if @new_assignee.save

SELECT "assignees".* FROM "assignees" WHERE "assignees"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @assignee = Assignee.find(params[:id])

SELECT "assignees".* FROM "assignees" WHERE "assignees"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @assignee = Assignee.find(params[:id])

SELECT "assignees".* FROM "assignees" WHERE "assignees"."id" = ? LIMIT 1  [["id", "2"]]
---
  def update
    @assignee = Assignee.find(params[:id])

SELECT "assignees".* FROM "assignees" WHERE "assignees"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "assignees" WHERE "assignees"."id" = 1
---
  def destroy
    @assignee = Assignee.find(params[:id])

    if @assignee.delete