app/controllers/to_dos_controller.rb

SELECT "to_dos".* FROM "to_dos"
---
  def index
    @to_dos = ToDo.all

INSERT INTO "to_dos" ("assignee_id", "description", "due_date", "task") VALUES (?, ?, ?, ?)  [["assignee_id", 2], ["description", "You know, feed the dog."], ["due_date", Sat, 26 Apr 2014], ["task", "Feed the Dog"]]
---
  def create
    @new_to_do = ToDo.new(to_do_params)
    if @new_to_do.save

SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."id" = ? LIMIT 1  [["id", "edit"]]
---
  def show
    @to_do = ToDo.find(params[:id])

SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @to_do = ToDo.find(params[:id])

SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "to_dos" SET "task" = ?, "description" = ?, "assignee_id" = ?, "due_date" = ? WHERE "to_dos"."id" = 6  [["task", "Cut the Grass"], ["description", "Cut the grass in the font and back of the house"], ["assignee_id", 4], ["due_date", Sat, 26 Apr 2014]]
---
  def update
    @to_do = ToDo.find(params[:id])
    if @to_do.update_attributes(to_do_params)

SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "to_dos" WHERE "to_dos"."id" = 2
---
  def destroy
    @to_do = ToDo.find(params[:id])

    if @to_do.delete

SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "to_dos" SET "completed" = ? WHERE "to_dos"."id" = 5  [["completed", true]]
---
  def change_completed
    @to_do = ToDo.find(params[:id])
    val = toggle_test(@to_do)
    @to_do.update_attributes(:completed => val)

SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."id" = ? LIMIT 1  [["id", "15"]]
UPDATE "to_dos" SET "completed" = ? WHERE "to_dos"."id" = 15  [["completed", false]]
---
  def change_completed_duplicate
    @to_do = ToDo.find(params[:id])
    val = toggle_test(@to_do)
    @to_do.update_attributes(:completed => val)

SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."id" = ? LIMIT 1  [["id", "16"]]
UPDATE "to_dos" SET "completed" = ? WHERE "to_dos"."id" = 16  [["completed", false]]
---
  def change_completed_three
    @to_do = ToDo.find(params[:id])
    val = toggle_test(@to_do)
    @to_do.update_attributes(:completed => val)

SELECT "to_dos".* FROM "to_dos" WHERE (completed LIKE 'f')
---
  def search
    search_terms = params[:search]
    @to_dos = ToDo.search(search_terms)